wty2019wty/esp32c3-ir-web-ESP32-C3/sdkconfig.defaults
# ESP32-S3: 4MB flash
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# 1kHz tick for snappier timing
CONFIG_FREERTOS_HZ=1000

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# NVS encryption: HMAC scheme derives the NVS keys from an eFuse key.
# The eFuse key (KEY4) is generated and burned automatically on first boot
# with this configuration - this is irreversible.
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_HMAC=y
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=4

# WebSocket server (status / frame push to replace polling)
CONFIG_HTTPD_WS_SUPPORT=y
